DeviceRegistryEvents
| where ActionType == "RegistryKeyCreated"
| extend TaskName = extract(@"([^\\]+)$", 1, RegistryKey)
| where RegistryKey has "HKEY_LOCAL_MACHINE\\SOFTWARE\\Microsoft\\Windows NT\\CurrentVersion\\Schedule\\TaskCache\\Tree\\"
| project TimeGenerated, InitiatingProcessFolderPath, InitiatingProcessCommandLine, RegistryKey
